; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s3-p29-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 p25 p26 p27 p28 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (OBJ p17)
    (OBJ p18)
    (OBJ p19)
    (OBJ p20)
    (OBJ p21)
    (OBJ p22)
    (OBJ p23)
    (OBJ p24)
    (OBJ p25)
    (OBJ p26)
    (OBJ p27)
    (OBJ p28)
    (at t0 l0-0)
    (at t1 l1-1)
    (at t2 l2-2)
    (at p0 l2-0)
    (at p1 l0-0)
    (at p2 l0-1)
    (at p3 l0-1)
    (at p4 l0-0)
    (at p5 l2-2)
    (at p6 l0-2)
    (at p7 l0-0)
    (at p8 l2-2)
    (at p9 l2-2)
    (at p10 l2-1)
    (at p11 l1-2)
    (at p12 l2-0)
    (at p13 l0-0)
    (at p14 l0-1)
    (at p15 l0-2)
    (at p16 l0-1)
    (at p17 l0-0)
    (at p18 l2-2)
    (at p19 l2-0)
    (at p20 l2-1)
    (at p21 l2-0)
    (at p22 l0-0)
    (at p23 l1-2)
    (at p24 l1-1)
    (at p25 l0-0)
    (at p26 l2-2)
    (at p27 l1-2)
    (at p28 l2-1)
    (at a0 l2-0)
)
(:goal
    (and
        (at p0 l0-0)
        (at p1 l1-1)
        (at p2 l0-1)
        (at p3 l2-2)
        (at p4 l1-2)
        (at p5 l1-2)
        (at p6 l2-0)
        (at p7 l0-2)
        (at p8 l1-2)
        (at p9 l0-1)
        (at p10 l2-1)
        (at p11 l2-2)
        (at p12 l0-0)
        (at p13 l2-2)
        (at p14 l2-2)
        (at p15 l0-0)
        (at p16 l2-2)
        (at p17 l1-1)
        (at p18 l1-1)
        (at p19 l0-1)
        (at p20 l0-1)
        (at p21 l0-0)
        (at p22 l2-0)
        (at p23 l2-2)
        (at p24 l0-0)
        (at p25 l1-0)
        (at p26 l2-1)
        (at p27 l0-0)
        (at p28 l1-0)
    )
)
)

; plan
1. (load-truck p9 t2 l2-2)
   deleted: (at p9 l2-2)
   added: (in p9 t2)
   goals met: 2 of 29
2. (load-truck p8 t2 l2-2)
   deleted: (at p8 l2-2)
   added: (in p8 t2)
   goals met: 2 of 29
3. (load-truck p5 t2 l2-2)
   deleted: (at p5 l2-2)
   added: (in p5 t2)
   goals met: 2 of 29
4. (load-truck p26 t2 l2-2)
   deleted: (at p26 l2-2)
   added: (in p26 t2)
   goals met: 2 of 29
5. (load-truck p18 t2 l2-2)
   deleted: (at p18 l2-2)
   added: (in p18 t2)
   goals met: 2 of 29
6. (load-truck p24 t1 l1-1)
   deleted: (at p24 l1-1)
   added: (in p24 t1)
   goals met: 2 of 29
7. (load-truck p7 t0 l0-0)
   deleted: (at p7 l0-0)
   added: (in p7 t0)
   goals met: 2 of 29
8. (load-airplane p21 a0 l2-0)
   deleted: (at p21 l2-0)
   added: (in p21 a0)
   goals met: 2 of 29
9. (load-airplane p19 a0 l2-0)
   deleted: (at p19 l2-0)
   added: (in p19 a0)
   goals met: 2 of 29
10. (load-airplane p12 a0 l2-0)
   deleted: (at p12 l2-0)
   added: (in p12 a0)
   goals met: 2 of 29
11. (load-airplane p0 a0 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 a0)
   goals met: 2 of 29
12. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 2 of 29
13. (unload-truck p9 t2 l2-0)
   deleted: (in p9 t2)
   added: (at p9 l2-0)
   goals met: 2 of 29
14. (unload-truck p8 t2 l2-0)
   deleted: (in p8 t2)
   added: (at p8 l2-0)
   goals met: 2 of 29
15. (unload-truck p5 t2 l2-0)
   deleted: (in p5 t2)
   added: (at p5 l2-0)
   goals met: 2 of 29
16. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 2 of 29
17. (load-truck p28 t2 l2-1)
   deleted: (at p28 l2-1)
   added: (in p28 t2)
   goals met: 2 of 29
18. (unload-truck p26 t2 l2-1)
   deleted: (in p26 t2)
   added: (at p26 l2-1)
   goals met: 3 of 29
19. (load-truck p20 t2 l2-1)
   deleted: (at p20 l2-1)
   added: (in p20 t2)
   goals met: 3 of 29
20. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 3 of 29
21. (unload-truck p28 t2 l2-0)
   deleted: (in p28 t2)
   added: (at p28 l2-0)
   goals met: 3 of 29
22. (unload-truck p20 t2 l2-0)
   deleted: (in p20 t2)
   added: (at p20 l2-0)
   goals met: 3 of 29
23. (unload-truck p18 t2 l2-0)
   deleted: (in p18 t2)
   added: (at p18 l2-0)
   goals met: 3 of 29
24. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 3 of 29
25. (load-truck p3 t0 l0-1)
   deleted: (at p3 l0-1)
   added: (in p3 t0)
   goals met: 3 of 29
26. (load-truck p16 t0 l0-1)
   deleted: (at p16 l0-1)
   added: (in p16 t0)
   goals met: 3 of 29
27. (load-truck p14 t0 l0-1)
   deleted: (at p14 l0-1)
   added: (in p14 t0)
   goals met: 3 of 29
28. (load-airplane p9 a0 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 a0)
   goals met: 3 of 29
29. (load-airplane p8 a0 l2-0)
   deleted: (at p8 l2-0)
   added: (in p8 a0)
   goals met: 3 of 29
30. (load-airplane p5 a0 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 a0)
   goals met: 3 of 29
31. (load-airplane p28 a0 l2-0)
   deleted: (at p28 l2-0)
   added: (in p28 a0)
   goals met: 3 of 29
32. (load-airplane p20 a0 l2-0)
   deleted: (at p20 l2-0)
   added: (in p20 a0)
   goals met: 3 of 29
33. (load-airplane p18 a0 l2-0)
   deleted: (at p18 l2-0)
   added: (in p18 a0)
   goals met: 3 of 29
34. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 3 of 29
35. (unload-truck p24 t1 l1-0)
   deleted: (in p24 t1)
   added: (at p24 l1-0)
   goals met: 3 of 29
36. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 3 of 29
37. (load-truck p27 t1 l1-2)
   deleted: (at p27 l1-2)
   added: (in p27 t1)
   goals met: 3 of 29
38. (load-truck p23 t1 l1-2)
   deleted: (at p23 l1-2)
   added: (in p23 t1)
   goals met: 3 of 29
39. (load-truck p11 t1 l1-2)
   deleted: (at p11 l1-2)
   added: (in p11 t1)
   goals met: 3 of 29
40. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 3 of 29
41. (unload-truck p27 t1 l1-0)
   deleted: (in p27 t1)
   added: (at p27 l1-0)
   goals met: 3 of 29
42. (unload-truck p23 t1 l1-0)
   deleted: (in p23 t1)
   added: (at p23 l1-0)
   goals met: 3 of 29
43. (unload-truck p11 t1 l1-0)
   deleted: (in p11 t1)
   added: (at p11 l1-0)
   goals met: 3 of 29
44. (drive-truck t0 l0-1 l0-2 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-2)
   goals met: 3 of 29
45. (unload-truck p7 t0 l0-2)
   deleted: (in p7 t0)
   added: (at p7 l0-2)
   goals met: 4 of 29
46. (load-truck p6 t0 l0-2)
   deleted: (at p6 l0-2)
   added: (in p6 t0)
   goals met: 4 of 29
47. (load-truck p15 t0 l0-2)
   deleted: (at p15 l0-2)
   added: (in p15 t0)
   goals met: 4 of 29
48. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 4 of 29
49. (unload-truck p6 t0 l0-0)
   deleted: (in p6 t0)
   added: (at p6 l0-0)
   goals met: 4 of 29
50. (unload-truck p3 t0 l0-0)
   deleted: (in p3 t0)
   added: (at p3 l0-0)
   goals met: 4 of 29
51. (unload-truck p16 t0 l0-0)
   deleted: (in p16 t0)
   added: (at p16 l0-0)
   goals met: 4 of 29
52. (unload-truck p15 t0 l0-0)
   deleted: (in p15 t0)
   added: (at p15 l0-0)
   goals met: 5 of 29
53. (unload-truck p14 t0 l0-0)
   deleted: (in p14 t0)
   added: (at p14 l0-0)
   goals met: 5 of 29
54. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 5 of 29
55. (unload-airplane p9 a0 l0-0)
   deleted: (in p9 a0)
   added: (at p9 l0-0)
   goals met: 5 of 29
56. (load-truck p9 t0 l0-0)
   deleted: (at p9 l0-0)
   added: (in p9 t0)
   goals met: 5 of 29
57. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 5 of 29
58. (unload-airplane p8 a0 l1-0)
   deleted: (in p8 a0)
   added: (at p8 l1-0)
   goals met: 5 of 29
59. (load-truck p8 t1 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 t1)
   goals met: 5 of 29
60. (unload-airplane p5 a0 l1-0)
   deleted: (in p5 a0)
   added: (at p5 l1-0)
   goals met: 5 of 29
61. (load-truck p5 t1 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 t1)
   goals met: 5 of 29
62. (unload-airplane p28 a0 l1-0)
   deleted: (in p28 a0)
   added: (at p28 l1-0)
   goals met: 6 of 29
63. (load-airplane p27 a0 l1-0)
   deleted: (at p27 l1-0)
   added: (in p27 a0)
   goals met: 6 of 29
64. (load-airplane p24 a0 l1-0)
   deleted: (at p24 l1-0)
   added: (in p24 a0)
   goals met: 6 of 29
65. (load-airplane p23 a0 l1-0)
   deleted: (at p23 l1-0)
   added: (in p23 a0)
   goals met: 6 of 29
66. (unload-airplane p18 a0 l1-0)
   deleted: (in p18 a0)
   added: (at p18 l1-0)
   goals met: 6 of 29
67. (load-truck p18 t1 l1-0)
   deleted: (at p18 l1-0)
   added: (in p18 t1)
   goals met: 6 of 29
68. (load-airplane p11 a0 l1-0)
   deleted: (at p11 l1-0)
   added: (in p11 a0)
   goals met: 6 of 29
69. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 6 of 29
70. (unload-truck p18 t1 l1-1)
   deleted: (in p18 t1)
   added: (at p18 l1-1)
   goals met: 7 of 29
71. (drive-truck t1 l1-1 l1-2 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 7 of 29
72. (unload-truck p8 t1 l1-2)
   deleted: (in p8 t1)
   added: (at p8 l1-2)
   goals met: 8 of 29
73. (unload-truck p5 t1 l1-2)
   deleted: (in p5 t1)
   added: (at p5 l1-2)
   goals met: 9 of 29
74. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 9 of 29
75. (unload-truck p9 t0 l0-1)
   deleted: (in p9 t0)
   added: (at p9 l0-1)
   goals met: 10 of 29
76. (fly-airplane a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 10 of 29
77. (load-airplane p6 a0 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a0)
   goals met: 10 of 29
78. (load-airplane p4 a0 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 a0)
   goals met: 10 of 29
79. (load-airplane p3 a0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 a0)
   goals met: 10 of 29
80. (unload-airplane p27 a0 l0-0)
   deleted: (in p27 a0)
   added: (at p27 l0-0)
   goals met: 11 of 29
81. (load-airplane p25 a0 l0-0)
   deleted: (at p25 l0-0)
   added: (in p25 a0)
   goals met: 11 of 29
82. (unload-airplane p24 a0 l0-0)
   deleted: (in p24 a0)
   added: (at p24 l0-0)
   goals met: 12 of 29
83. (load-airplane p22 a0 l0-0)
   deleted: (at p22 l0-0)
   added: (in p22 a0)
   goals met: 12 of 29
84. (unload-airplane p21 a0 l0-0)
   deleted: (in p21 a0)
   added: (at p21 l0-0)
   goals met: 13 of 29
85. (unload-airplane p20 a0 l0-0)
   deleted: (in p20 a0)
   added: (at p20 l0-0)
   goals met: 13 of 29
86. (unload-airplane p19 a0 l0-0)
   deleted: (in p19 a0)
   added: (at p19 l0-0)
   goals met: 13 of 29
87. (load-airplane p17 a0 l0-0)
   deleted: (at p17 l0-0)
   added: (in p17 a0)
   goals met: 13 of 29
88. (load-airplane p16 a0 l0-0)
   deleted: (at p16 l0-0)
   added: (in p16 a0)
   goals met: 13 of 29
89. (load-airplane p14 a0 l0-0)
   deleted: (at p14 l0-0)
   added: (in p14 a0)
   goals met: 13 of 29
90. (load-airplane p13 a0 l0-0)
   deleted: (at p13 l0-0)
   added: (in p13 a0)
   goals met: 13 of 29
91. (unload-airplane p12 a0 l0-0)
   deleted: (in p12 a0)
   added: (at p12 l0-0)
   goals met: 14 of 29
92. (load-airplane p1 a0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 a0)
   goals met: 14 of 29
93. (unload-airplane p0 a0 l0-0)
   deleted: (in p0 a0)
   added: (at p0 l0-0)
   goals met: 15 of 29
94. (fly-airplane a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 15 of 29
95. (unload-airplane p4 a0 l1-0)
   deleted: (in p4 a0)
   added: (at p4 l1-0)
   goals met: 15 of 29
96. (unload-airplane p25 a0 l1-0)
   deleted: (in p25 a0)
   added: (at p25 l1-0)
   goals met: 16 of 29
97. (unload-airplane p17 a0 l1-0)
   deleted: (in p17 a0)
   added: (at p17 l1-0)
   goals met: 16 of 29
98. (unload-airplane p1 a0 l1-0)
   deleted: (in p1 a0)
   added: (at p1 l1-0)
   goals met: 16 of 29
99. (fly-airplane a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 16 of 29
100. (unload-airplane p6 a0 l2-0)
   deleted: (in p6 a0)
   added: (at p6 l2-0)
   goals met: 17 of 29
101. (unload-airplane p3 a0 l2-0)
   deleted: (in p3 a0)
   added: (at p3 l2-0)
   goals met: 17 of 29
102. (load-truck p3 t2 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 t2)
   goals met: 17 of 29
103. (unload-airplane p23 a0 l2-0)
   deleted: (in p23 a0)
   added: (at p23 l2-0)
   goals met: 17 of 29
104. (load-truck p23 t2 l2-0)
   deleted: (at p23 l2-0)
   added: (in p23 t2)
   goals met: 17 of 29
105. (unload-airplane p22 a0 l2-0)
   deleted: (in p22 a0)
   added: (at p22 l2-0)
   goals met: 18 of 29
106. (unload-airplane p16 a0 l2-0)
   deleted: (in p16 a0)
   added: (at p16 l2-0)
   goals met: 18 of 29
107. (load-truck p16 t2 l2-0)
   deleted: (at p16 l2-0)
   added: (in p16 t2)
   goals met: 18 of 29
108. (unload-airplane p14 a0 l2-0)
   deleted: (in p14 a0)
   added: (at p14 l2-0)
   goals met: 18 of 29
109. (load-truck p14 t2 l2-0)
   deleted: (at p14 l2-0)
   added: (in p14 t2)
   goals met: 18 of 29
110. (unload-airplane p13 a0 l2-0)
   deleted: (in p13 a0)
   added: (at p13 l2-0)
   goals met: 18 of 29
111. (load-truck p13 t2 l2-0)
   deleted: (at p13 l2-0)
   added: (in p13 t2)
   goals met: 18 of 29
112. (unload-airplane p11 a0 l2-0)
   deleted: (in p11 a0)
   added: (at p11 l2-0)
   goals met: 18 of 29
113. (load-truck p11 t2 l2-0)
   deleted: (at p11 l2-0)
   added: (in p11 t2)
   goals met: 18 of 29
114. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 18 of 29
115. (unload-truck p3 t2 l2-2)
   deleted: (in p3 t2)
   added: (at p3 l2-2)
   goals met: 19 of 29
116. (unload-truck p23 t2 l2-2)
   deleted: (in p23 t2)
   added: (at p23 l2-2)
   goals met: 20 of 29
117. (unload-truck p16 t2 l2-2)
   deleted: (in p16 t2)
   added: (at p16 l2-2)
   goals met: 21 of 29
118. (unload-truck p14 t2 l2-2)
   deleted: (in p14 t2)
   added: (at p14 l2-2)
   goals met: 22 of 29
119. (unload-truck p13 t2 l2-2)
   deleted: (in p13 t2)
   added: (at p13 l2-2)
   goals met: 23 of 29
120. (unload-truck p11 t2 l2-2)
   deleted: (in p11 t2)
   added: (at p11 l2-2)
   goals met: 24 of 29
121. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 24 of 29
122. (load-truck p4 t1 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 t1)
   goals met: 24 of 29
123. (load-truck p17 t1 l1-0)
   deleted: (at p17 l1-0)
   added: (in p17 t1)
   goals met: 24 of 29
124. (load-truck p1 t1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 t1)
   goals met: 24 of 29
125. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 24 of 29
126. (unload-truck p17 t1 l1-1)
   deleted: (in p17 t1)
   added: (at p17 l1-1)
   goals met: 25 of 29
127. (unload-truck p1 t1 l1-1)
   deleted: (in p1 t1)
   added: (at p1 l1-1)
   goals met: 26 of 29
128. (drive-truck t1 l1-1 l1-2 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 26 of 29
129. (unload-truck p4 t1 l1-2)
   deleted: (in p4 t1)
   added: (at p4 l1-2)
   goals met: 27 of 29
130. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 27 of 29
131. (load-truck p20 t0 l0-0)
   deleted: (at p20 l0-0)
   added: (in p20 t0)
   goals met: 27 of 29
132. (load-truck p19 t0 l0-0)
   deleted: (at p19 l0-0)
   added: (in p19 t0)
   goals met: 27 of 29
133. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 27 of 29
134. (unload-truck p20 t0 l0-1)
   deleted: (in p20 t0)
   added: (at p20 l0-1)
   goals met: 28 of 29
135. (unload-truck p19 t0 l0-1)
   deleted: (in p19 t0)
   added: (at p19 l0-1)
   goals met: 29 of 29
